Revit 2027 API
AnalyticalPowerDistributableNodeData.AssignedVoltage Property
 The voltage assigned through the distribution system of the power distributable node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AssignedVoltage { get; }
Public ReadOnly Property AssignedVoltage As Double
	Get
public:
property double AssignedVoltage {
	double get ();
}
member AssignedVoltage : float with get
Property Value
Double
See Also
Reference
AnalyticalPowerDistributableNodeData Class
Autodesk.Revit.DB.Electrical Namespace